// --- КОНФІГУРАЦІЯ ПРОЄКТУ ---
const ADMINS = [8216362223, 2067230442]; // ЗАМІНИ НА СВІЙ ID
const DEADLINE = new Date("2026-04-04T00:00:00+03:00").getTime();

const CASES = {
    basic: { n: "Common Case 🐾", p: 285, drop: [
        {n:'Собака', s:'🐶', r:'Звичайний', m:1.05, w:40, c:'#94a3b8'},
        {n:'Кіт', s:'🐱', r:'Звичайний', m:1.05, w:40, c:'#94a3b8'},
        {n:'Кролик', s:'🐰', r:'Незвичайний', m:1.08, w:20, c:'#3b82f6'}
    ]},
    uncommon: { n: "Rare Case 🌟", p: 525, drop: [
        {n:'Кролик', s:'🐰', r:'Незвичайний', m:1.08, w:46, c:'#3b82f6'},
        {n:'Лисиця', s:'🦊', r:'Незвичайний', m:1.09, w:40, c:'#3b82f6'},
        {n:'Вовк', s:'🐺', r:'Рідкісний', m:1.11, w:14, c:'#a855f7'}
    ]},
    rare: { n: "Epic Case 💎", p: 875, drop: [
        {n:'Вовк', s:'🐺', r:'Рідкісний', m:1.11, w:50, c:'#a855f7'},
        {n:'Бджола', s:'🐝', r:'Рідкісний', m:1.12, w:40, c:'#a855f7'},
        {n:'Панда', s:'🐼', r:'Епічний', m:1.14, w:10, c:'#f59e0b'}
    ]},
    legend: { n: "Legendary Case 👑", p: 1200, drop: [
        {n:'Панда', s:'🐼', r:'Епічний', m:1.14, w:56, c:'#f59e0b'},
        {n:'Лев', s:'🦁', r:'Легендарний', m:1.16, w:24, c:'#f43f5e'},
        {n:'Дракон', s:'🐲', r:'Легендарний', m:1.17, w:20, c:'#f43f5e'}
    ]},
    ocean: { n: "Ocean Case 🌊", p: 1500, limited: true, drop: [
        {n:'Рибка', s:'🐟', r:'Рідкісний', m:1.16, w:45, c:'#a855f7'},
        {n:'Тропічна рибка', s:'🐠', r:'Епічний', m:1.19, w:35, c:'#f59e0b'},
        {n:'Акула', s:'🦈', r:'Легендарний', m:1.23, w:15, c:'#f43f5e'},
        {n:'Восьминіг', s:'🐙', r:'Міфічний', m:1.30, w:5, c:'#ff00ff'}
    ]}
};

const GAME_CONFIG = {
    f50: 1.55, dice: 2.05,
    wheel: [{w:55, m:0}, {w:25, m:1.4}, {w:15, m:1.6}, {w:5, m:1.8}]
};
